andeyqi/CAN_FD/bsp/stm32/stm32f446-st-nucleo/applications/tcan4x5x/TCAN4x5x_Data_Structs.h
            //! @brief DEV_IR[3] : SPI Error
            uint8_t SPIERR : 1;

            //! @brief DEV_IR[4] : CBF, CAN Bus Fault
            uint8_t CBF : 1;

            //! @brief DEV_IR[5] : CANERR, CAN Error
            uint8_t CANERR : 1;

            //! @brief DEV_IR[6] : WKRQ, Wake Request
            uint8_t WKRQ : 1;

            //! @brief DEV_IR[7] : GLOBALERR, Global Error. Is the OR output of all interrupts
            uint8_t GLOBALERR : 1;

            //! @brief DEV_IR[8] : CANDOM, Can bus stuck dominant
            uint8_t CANDOM : 1;

            //! @brief DEV_IR[9] : RESERVED
            uint8_t RESERVED : 1;

            //! @brief DEV_IR[10] : CANTO, CAN Timeout
            uint8_t CANTO : 1;

            //! @brief DEV_IR[11] : RESERVED
            uint8_t RESERVED2 : 1;

            //! @brief DEV_IR[12] : FRAME_OVF, Frame Error Overflow (If Selective Wake is equipped)
            uint8_t FRAME_OVF : 1;

            //! @brief DEV_IR[13] : WKERR, Wake Error
            uint8_t WKERR : 1;

            //! @brief DEV_IR[14] : LWU, Local Wake Up
            uint8_t LWU : 1;

            //! @brief DEV_IR[15] : CANINT, CAN Bus Wake Up Interrupt
            uint8_t CANINT : 1;

            //! @brief DEV_IR[16] : ECCERR, MRAM ECC Error
            uint8_t ECCERR : 1;

            //! @brief DEV_IR[17] : Reserved
            uint8_t RESERVED3 : 1;

            //! @brief DEV_IR[18] : WDTO, Watchdog Time Out
            uint8_t WDTO : 1;

            //! @brief DEV_IR[19] : TSD, Thermal Shut Down
            uint8_t TSD : 1;

            //! @brief DEV_IR[20] : PWRON, Power On Interrupt
            uint8_t PWRON : 1;

            //! @brief DEV_IR[21] : UVIO, Undervoltage on UVIO
            uint8_t UVIO : 1;

            //! @brief DEV_IR[22] : UVSUP, Undervoltage on VSUP and VCCOUT
            uint8_t UVSUP : 1;

            //! @brief DEV_IR[23] : SMS, Sleep Mode Status Flag. Set when sleep mode is entered due to WKERR, UVIO, or TSD faults
            uint8_t SMS : 1;

            //! @brief DEV_IR[24] : CANBUSBAT, CAN Shorted to VBAT
            uint8_t CANBUSBAT : 1;

            //! @brief DEV_IR[25] : CANBUSGND, CAN Shorted to GND
            uint8_t CANBUSGND : 1;

            //! @brief DEV_IR[26] : CANBUSOPEN, CAN Open fault
            uint8_t CANBUSOPEN : 1;

            //! @brief DEV_IR[27] : CANLGND, CANL GND
            uint8_t CANLGND : 1;

            //! @brief DEV_IR[28] : CANHBAT, CANH to VBAT
            uint8_t CANHBAT : 1;

            //! @brief DEV_IR[29] : CANHCANL, CANH and CANL shorted
            uint8_t CANHCANL : 1;

            //! @brief DEV_IR[30] : CANBUSTERMOPEN, CAN Bus has termination point open
            uint8_t CANBUSTERMOPEN : 1;

            //! @brief DEV_IR[31] : CANBUSNOM, CAN Bus is normal flag
            uint8_t CANBUSNORM : 1;
        };
    };
} TCAN4x5x_Device_Interrupts;

/**
 * @brief Struct containing the device interrupt enable bit field
 */
typedef struct
{
    union
    {
        //! Full register as single 32-bit word
        uint32_t word;

        struct
        {
            //! @brief DEV_IE[0:7] : RESERVED
            uint8_t RESERVED1 : 8;

            //! @brief DEV_IE[8] : CANDOM, Can bus stuck dominant
            uint8_t CANDOMEN : 1;

            //! @brief DEV_IE[9] : RESERVED
            uint8_t RESERVED2 : 1;

            //! @brief DEV_IE[10] : CANTO, CAN Timeout
            uint8_t CANTOEN : 1;

            //! @brief DEV_IE[11] : RESERVED
            uint8_t RESERVED3 : 1;

            //! @brief DEV_IE[12] : FRAME_OVF, Frame Error Overflow (If Selective Wake is equipped)
            uint8_t FRAME_OVFEN : 1;

            //! @brief DEV_IE[13] : WKERR, Wake Error
            uint8_t WKERREN : 1;

            //! @brief DEV_IE[14] : LWU, Local Wake Up
            uint8_t LWUEN : 1;

            //! @brief DEV_IE[15] : CANINT, CAN Bus Wake Up Interrupt
            uint8_t CANINTEN : 1;

            //! @brief DEV_IE[16] : ECCERR, MRAM ECC Error
            uint8_t ECCERREN : 1;

            //! @brief DEV_IE[17] : Reserved
            uint8_t RESERVED4 : 1;

            //! @brief DEV_IE[18] : WDTO, Watchdog Time Out
            uint8_t WDTOEN : 1;

            //! @brief DEV_IE[19] : TSD, Thermal Shut Down
            uint8_t TSDEN : 1;

            //! @brief DEV_IE[20] : PWRON, Power On Interrupt
            uint8_t PWRONEN : 1;

            //! @brief DEV_IE[21] : UVIO, Undervoltage on UVIO
            uint8_t UVIOEN : 1;

            //! @brief DEV_IE[22] : UVSUP, Undervoltage on VSUP and VCCOUT
            uint8_t UVSUPEN : 1;

            //! @brief DEV_IE[23] : SMS, Sleep Mode Status Flag. Set when sleep mode is entered due to WKERR, UVIO, or TSD faults
            uint8_t SMSEN : 1;

            //! @brief DEV_IE[24] : CANBUSBAT, CAN Shorted to VBAT
            uint8_t CANBUSBATEN : 1;

            //! @brief DEV_IE[25] : CANBUSGND, CAN Shorted to GND
            uint8_t CANBUSGNDEN : 1;

            //! @brief DEV_IE[26] : CANBUSOPEN, CAN Open fault
            uint8_t CANBUSOPENEN : 1;

            //! @brief DEV_IE[27] : CANLGND, CANL GND
            uint8_t CANLGNDEN : 1;

            //! @brief DEV_IE[28] : CANHBAT, CANH to VBAT
            uint8_t CANHBATEN : 1;

            //! @brief DEV_IE[29] : CANHCANL, CANH and CANL shorted
            uint8_t CANHCANLEN : 1;

            //! @brief DEV_IE[30] : CANBUSTERMOPEN, CAN Bus has termination point open
            uint8_t CANBUSTERMOPENEN : 1;

            //! @brief DEV_IE[31] : CANBUSNOM, CAN Bus is normal flag
            uint8_t CANBUSNORMEN : 1;
        };
    };
} TCAN4x5x_Device_Interrupt_Enable;


typedef enum
{
    TCAN4x5x_DEV_CONFIG_GPO1_SPI_FAULT_INT = 0,
    TCAN4x5x_DEV_CONFIG_GPO1_MCAN_INT1 = 1,
    TCAN4x5x_DEV_CONFIG_GPO1_UNDER_VOLTAGE_OR_THERMAL_INT = 2,
} TCAN4x5x_DEV_CONFIG_GPO1_CONFIG;

typedef enum
{
    TCAN4x5x_DEV_CONFIG_GPIO1_CONFIG_GPO = 0,
    TCAN4x5x_DEV_CONFIG_GPIO1_CONFIG_WATCHDOG_INPUT = 2
} TCAN4x5x_DEV_CONFIG_GPIO1_CONFIG;

